Revit 2027 API
RebarHandlesData Methods
The RebarHandlesData type exposes the following members.
Methods
Name | Description
AddCustomHandle |  Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCustomHandles |  Gets the handle definitions for the rebar that were added.
GetEndHandle |  Gets the end handle tag.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRebarElement |  Gets the rebar element that will be updated by the server.
GetStartHandle |  Gets the start handle tag.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEndHandle |  Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.
SetStartHandle |  Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace